In [17]:

import numpy as np
import pandas as pd
from kmodes.kprototypes import KPrototypes
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns

In [18]:
# Reading Dataset
bank = pd.read_csv('bankmarketing.csv', sep=",",engine = 'python')

In [19]:
bank = bank.loc[:,['job', 'marital', 'education', 'default', 'housing', 'loan','contact','month','day_of_week','poutcome','age','duration','euribor3m']]

In [21]:
bank.head()
bank.describe()

               age      duration     euribor3m
count  41188.00000  41188.000000  41188.000000
mean      40.02406    258.285010      3.621291
std       10.42125    259.279249      1.734447
min       17.00000      0.000000      0.634000
25%       32.00000    102.000000      1.344000
50%       38.00000    180.000000      4.857000
75%       47.00000    319.000000      4.961000
max       98.00000   4918.000000      5.045000

In [22]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()

# standardizing data
columns_to_normalize     = ['job', 'marital', 'education', 'default', 'housing', 'loan','contact','month','day_of_week','poutcome']
bank[columns_to_normalize] = bank[columns_to_normalize].apply(lambda x : le.fit_transform(x))

bank.head()

,job,marital,education,default,housing,loan,contact,month,day_of_week,poutcome,age,duration,euribor3m
0,3,1,0,0,0,0,1,6,1,1,56,261,4.857
1,7,1,3,1,0,0,1,6,1,1,57,149,4.857
2,7,1,3,0,2,0,1,6,1,1,37,226,4.857
3,0,1,1,0,0,0,1,6,1,1,40,151,4.857
4,7,1,3,0,0,2,1,6,1,1,56,307,4.857

In [23]:
# Converting the dataset into matrix
bank_matrix = bank.as_matrix()

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.

In [24]:
bank_matrix

array([[  3.   ,   1.   ,   0.   , ...,  56.   , 261.   ,   4.857],
       [  7.   ,   1.   ,   3.   , ...,  57.   , 149.   ,   4.857],
       [  7.   ,   1.   ,   3.   , ...,  37.   , 226.   ,   4.857],
       ...,
       [  5.   ,   1.   ,   6.   , ...,  56.   , 189.   ,   1.028],
       [  9.   ,   1.   ,   5.   , ...,  44.   , 442.   ,   1.028],
       [  5.   ,   1.   ,   5.   , ...,  74.   , 239.   ,   1.028]])

In [26]:
# Running K-Prototype clustering
kproto = KPrototypes(n_clusters=5, init='Cao')
clusters = kproto.fit_predict(bank_matrix, categorical=[0,1,2,3,4,5,6,7,8,9])

In [ ]:
#Choosing optimal K
cost = []
for num_clusters in list(range(1,9)):
    kproto = KPrototypes(n_clusters=num_clusters, init='Cao')
    kproto.fit_predict(bank_matrix, categorical=[0,1,2,3,4,5,6,7,8,9])
    cost.append(kproto.cost_)
    
plt.plot(cost)